# Set up

This repository contains code that was written by me to solve a practical exam from Datacamp. I do not own any rights to the data or the tasks described in the assignment. I have no affiliation with the original creators or owners of the assignment.

In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\eunjeonglee\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython-sql) (3.11.0)
Requirement already satisfied: ipython in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython-sql) (8.25.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython-sql) (2.0.30)
Requirement already satisfied: sqlparse in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython-sql) (0.5.1)
Requirement already satisfied: six in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\eunjeonglee\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\eunjeonglee\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.1)
Requirement already satisfied: decorator in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: matplotlib-inline in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: stack-data in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: colorama in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\eunjeonglee\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\eunjeonglee\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: executing in c:\users\eunjeonglee\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in c:\users\eunjeonglee\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\eunjeonglee\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)

In [2]:
!pip install psycopg2-binary sqlalchemy ipython-sql
!pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in c:\users\eunjeonglee\anaconda3\lib\site-packages (2.9.9)
Requirement already satisfied: sqlalchemy in c:\users\eunjeonglee\anaconda3\lib\site-packages (2.0.30)
Requirement already satisfied: ipython-sql in c:\users\eunjeonglee\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\eunjeonglee\anaconda3\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\eunjeonglee\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)
Requirement already satisfied: prettytable in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython-sql) (3.11.0)
Requirement already satisfied: ipython in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython-sql) (8.25.0)
Requirement already satisfied: sqlparse in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython-sql) (0.5.1)
Requirement already satisfied: six in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: decorator in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: matplotlib-inline in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: stack-data in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: colorama in c:\users\eunjeonglee\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\eunjeonglee\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\eunjeonglee\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: executing in c:\users\eunjeonglee\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in c:\users\eunjeonglee\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\eunjeonglee\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: psycopg2-binary in c:\users\eunjeonglee\anaconda3\lib\site-packages (2.9.9)

In [5]:
import pandas as pd
import os
path = os.getcwd()
path = path.replace("\\", "/")

In [4]:
file = "/datalab_export_2024-08-24 11_05_09.csv"
pet_supplies = pd.read_csv(path + file)
pet_supplies.head()

,product_id,category,animal,size,price,sales,rating,repeat_purchase
0,1,Food,Bird,large,51.1,1860.62,7.0,1
1,2,Housing,Bird,MEDIUM,35.98,963.60,6.0,0
2,3,Food,Dog,medium,31.23,898.30,5.0,1
3,4,Medicine,Cat,small,24.95,982.15,6.0,1
4,5,Housing,Cat,Small,26.18,832.63,7.0,1

## PostgreSQL Connection
Now set up to run SQL codes from JupyterLab.

In [21]:
from sqlalchemy import create_engine

# Define connection parameters
username = 'postgres'
password = '0000'  # Update with your actual password, if any
db_name = 'postgres'  # The name of the database to use

db_url = f'postgresql://{username}:{password}@localhost:5432/{db_name}'

engine = create_engine(db_url)

# Load the ipython-sql extension and connect to the PostgreSQL database
%load_ext sql
%sql $db_url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [7]:
import pandas as pd
pet_supplies.to_sql('pet_supplies', con=engine, if_exists='replace', index=False)

100

In [22]:
%%sql
SELECT *
FROM pet_supplies
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[(1, 'Food', 'Bird', 'large', '51.1', 1860.62, 7.0, 1),
 (2, 'Housing', 'Bird', 'MEDIUM', '35.98', 963.6, 6.0, 0),
 (3, 'Food', 'Dog', 'medium', '31.23', 898.3, 5.0, 1),
 (4, 'Medicine', 'Cat', 'small', '24.95', 982.15, 6.0, 1),
 (5, 'Housing', 'Cat', 'Small', '26.18', 832.63, 7.0, 1),
 (6, 'Housing', 'Dog', 'Small', '30.77', 874.58, 7.0, 0),
 (7, 'Housing', 'Dog', 'Small', '31.04', 875.07, 5.0, 0),
 (8, 'Toys', 'Cat', 'medium', '28.9', 1074.31, 4.0, 0),
 (9, 'Equipment', 'Fish', 'MEDIUM', '17.82', 503.67, 5.0, 0),
 (10, 'Medicine', 'Dog', 'medium', '24.93', 838.88, 8.0, 0)]

# Task 1

From taking a quick look at the data, you are pretty certain it isn't quite as it should be. You need to make sure all of the data is clean before you start your analysis. The table below shows what the data should look like. 

Write a query to return a table that matches the description provided.

Do not update the original table. 

| Column Name | Criteria                                                |
|-------------|---------------------------------------------------------|
|product_id | Nominal. The unique identifier of the product. </br>Missing values are not possible due to the database structure.|
| category | Nominal. The category of the product, one of 6 values (Housing, Food, Toys, Equipment, Medicine, Accessory). </br>Missing values should be replaced with “Unknown”. |
| animal | Nominal. The type of animal the product is for. One of Dog, Cat, Fish, Bird. </br>Missing values should be replaced with “Unknown”. |
| size | Ordinal. The size of animal the product is for. Small, Medium, Large. </br>Missing values should be replaced with “Unknown”.|
| price | Continuous. The price the product is sold at. Can be any positive value, round to 2 decimal places. </br>Missing values should be replaced with 0. |
| sales | Continuous. The value of all sales of the product in the last year. This can be any positive value, rounded to 2 decimal places. </br>Missing values should be replaced with the overall median sales. |
| rating | Discrete. Customer rating of the product from 1 to 10. </br>Missing values should be replaced with 0. |
| repeat_purchase | Nominal. Whether customers repeatedly buy the product (1) or not (0). </br>Missing values should be removed. |

## Investigate Missing Values
Firstly, I investigated what kind of missing values each column contain, in order for replacing it upon conditions.

In [23]:
%%sql
SELECT DISTINCT category
FROM pet_supplies
WHERE category NOT IN ('Housing', 'Food', 'Toys', 'Equipment', 'Medicine', 'Accessory')

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('-',)]

In [24]:
%%sql
SELECT DISTINCT animal
FROM pet_supplies
WHERE animal NOT IN ('Dog', 'Cat', 'Fish', 'Bird')

 * postgresql://postgres:***@localhost:5432/postgres
0 rows affected.

[]

In [25]:
%%sql
SELECT INITCAP(size)
FROM pet_supplies
WHERE INITCAP(size) NOT IN ('Small', 'Medium', 'Large');

 * postgresql://postgres:***@localhost:5432/postgres
0 rows affected.

[]

In [26]:
%%sql
SELECT DISTINCT sales
FROM pet_supplies
WHERE NOT (sales::text ~ '^\d+(\.\d+)?$')
    OR (CAST(sales AS numeric) <= 0)

 * postgresql://postgres:***@localhost:5432/postgres
0 rows affected.

[]

In [27]:
%%sql
SELECT DISTINCT sales
FROM pet_supplies
ORDER BY sales --DESC
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(503.67,), (506.2,), (506.75,), (518.45,), (542.06,)]

In [28]:
%%sql
SELECT DISTINCT price
FROM pet_supplies
WHERE NOT (price ~ '^\d+(\.\d+)?$')
    OR (CAST(price AS numeric) <= 0)

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('unlisted',)]

In [29]:
%%sql
SELECT DISTINCT rating
FROM pet_supplies
ORDER BY rating DESC

 * postgresql://postgres:***@localhost:5432/postgres
9 rows affected.

[(None,), (8.0,), (7.0,), (6.0,), (5.0,), (4.0,), (3.0,), (2.0,), (1.0,)]

In [30]:
%%sql
SELECT DISTINCT repeat_purchase
FROM pet_supplies
WHERE repeat_purchase NOT IN (0, 1)

 * postgresql://postgres:***@localhost:5432/postgres
0 rows affected.

[]

To sum up, the missing values of each column is as follows: <br>
+ `product_id` : N/A
+ `category` : '-'
+ `animal` : N/A
+ `size` : N/A
+ `price` : 'unlisted'
+ `sales` : N/A
+ `rating` : 'None'
+ `repeat_purchase` : N/A

## Return the Query as Described

In [31]:
%%sql
SELECT product_id,
	CASE WHEN category = '-' THEN 'Unknown' ELSE category END AS category,
    animal,
    INITCAP(size) AS size,
	CASE WHEN price = 'unlisted' THEN 0 ELSE price::numeric END AS price,
	sales,
	CASE WHEN rating IS NULL THEN 0 ELSE rating END AS rating,
    repeat_purchase
FROM pet_supplies
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(1, 'Food', 'Bird', 'Large', Decimal('51.1'), 1860.62, 7.0, 1),
 (2, 'Housing', 'Bird', 'Medium', Decimal('35.98'), 963.6, 6.0, 0),
 (3, 'Food', 'Dog', 'Medium', Decimal('31.23'), 898.3, 5.0, 1),
 (4, 'Medicine', 'Cat', 'Small', Decimal('24.95'), 982.15, 6.0, 1),
 (5, 'Housing', 'Cat', 'Small', Decimal('26.18'), 832.63, 7.0, 1)]

# Task 2

You want to show whether sales are higher for repeat purchases for different animals. You also want to give a range for the sales.

Write a query to return the `animal`, `repeat_purchase` indicator and the `avg_sales`, along with the `min_sales` and `max_sales`. All values should be rounded to whole numbers. 

You should use the original `pet_supplies` data for this task.

In [32]:
%%sql
SELECT animal,
	repeat_purchase,
	ROUND(avg(sales)) AS avg_sales,
	ROUND(min(sales)) AS min_sales,
	ROUND(max(sales)) AS max_sales
FROM pet_supplies
GROUP BY animal, repeat_purchase

 * postgresql://postgres:***@localhost:5432/postgres
8 rows affected.

[('Fish', 1, 699.0, 506.0, 1024.0),
 ('Bird', 0, 1383.0, 860.0, 2249.0),
 ('Dog', 0, 1091.0, 579.0, 1459.0),
 ('Dog', 1, 1210.0, 675.0, 1793.0),
 ('Cat', 0, 989.0, 790.0, 1334.0),
 ('Bird', 1, 1354.0, 859.0, 1861.0),
 ('Fish', 0, 718.0, 504.0, 1016.0),
 ('Cat', 1, 936.0, 518.0, 1367.0)]

# Task 3

The management team want to focus on efforts in the next year on the most popular pets - cats and dogs - for products that are bought repeatedly. 

Write a query to return the `product_id`, `sales` and `rating` for the relevant products.

You should use the original `pet_supplies` data for this task.

In [33]:
%%sql
SELECT product_id,
	sales,
	rating
FROM pet_supplies
WHERE animal IN ('Cat', 'Dog')
AND repeat_purchase = 1
LIMIT 5

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(3, 898.3, 5.0),
 (4, 982.15, 6.0),
 (5, 832.63, 7.0),
 (11, 1457.22, 7.0),
 (14, 1450.5, 6.0)]